
## Plan Result




<pre><code>Plan: 8 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.fpl-scheduler-postgres-v15-flexible-server.azurerm_postgresql_flexible_server.pgsql_server
  * module.fpl-scheduler-postgres-v15-flexible-server.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.fpl-scheduler-postgres-v15-flexible-server.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.fpl-scheduler-postgres-v15-flexible-server.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.fpl-scheduler-postgres-v15-flexible-server.azurerm_postgresql_flexible_server_database.pg_databases[&#34;fpl_scheduler&#34;]
  * module.fpl-scheduler-postgres-v15-flexible-server.azurerm_resource_group.rg[0]
  * module.fpl-scheduler-postgres-v15-flexible-server.null_resource.set-user-permissions-additionaldbs[&#34;fpl_scheduler&#34;]
  * module.fpl-scheduler-postgres-v15-flexible-server.random_password.password
* Update
  * module.fpl-action-group.azurerm_resource_group_template_deployment.action-group
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.fpl-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.Resources/deployments/fpl-support"
        name                = "fpl-support"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.fpl-scheduler-postgres-v15-flexible-server.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "fpl-case-service-postgresql-v15-flexible-server-aat-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "fpl-case-service-postgresql-v15-flexible-server-aat-data-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"         = "family-public-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/fpl-ccd-configuration.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fpla-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Family Public Law"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.fpl-scheduler-postgres-v15-flexible-server.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "fpl-case-service-postgresql-v15-flexible-server-aat-data-aat"
      + server_name         = "fpl-case-service-postgresql-v15-flexible-server-aat-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.fpl-scheduler-postgres-v15-flexible-server.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "fpl-case-service-postgresql-v15-flexible-server-aat-data-aat"
      + server_name         = "fpl-case-service-postgresql-v15-flexible-server-aat-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.fpl-scheduler-postgres-v15-flexible-server.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "plpgsql, pg_stat_statements, pg_buffercache"
    }

  # module.fpl-scheduler-postgres-v15-flexible-server.azurerm_postgresql_flexible_server_database.pg_databases["fpl_scheduler"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "fpl_scheduler"
      + server_id = (known after apply)
    }

  # module.fpl-scheduler-postgres-v15-flexible-server.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "fpl-case-service-postgresql-v15-flexible-server-aat-data-aat"
      + tags     = {
          + "application"         = "family-public-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/fpl-ccd-configuration.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fpla-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Family Public Law"
        }
    }

  # module.fpl-scheduler-postgres-v15-flexible-server.null_resource.set-user-permissions-additionaldbs["fpl_scheduler"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "name"           = "fpl-case-service-postgresql-v15-flexible-server-aat"
          + "script_hash"    = "f1b050abe4f2e8fc188c106259b04ba5034688164070e5ebb3e10137ad569f93"
        }
    }

  # module.fpl-scheduler-postgres-v15-flexible-server.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.KeyVault/vaults/fpl-aat|fpl-aat"
        name                           = "fpl-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 8 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":4791,"Program":"tfcmt","SHA1":"","Vars":{}} -->